// Написати функцію, яка приймає один параметр. При першому виклику вона запам'ятовує його, при другому —
// підсумовує переданий параметр з тим, що передали перший раз і тд.Все це із замиканнями, наприклад:
// sum(3) = 3 sum(5) = 8 sum(20) = 28



// Даний масив з елементами різних типів.Створити функцію, яка вираховує середнє арифметичне лише числових елементів 
// даного масиву.

// Написати функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x та y, рядок znak. 
// У змінній znak може бути значення +, -, *, /, %, ^ (ступінь). Вивести результат математичної дії, 
// вказаної у змінній znak.Обидва числа та знак виходять від користувача.

// Написати функцію заповнення даними користувача двомірного масиву.Довжину основного масиву та внутрішніх 
// масивів задає користувач.Значення всіх елементів масивів задає користувач.

// Створити функцію, яка видаляє з рядка всі символи, які ми передали другим аргументом. 
// 'func("hello world", ['l', 'd'])' поверне нам "heo wor".Вихідний рядок та символи для видалення задає користувач
